# EXPLORING A YELP DATASET HELLO

In [42]:
import numpy as np
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt

In [16]:
pd.options.display.max_rows = 50 # maximum number of rows to display

In [40]:
%load_ext sql
# %config SqlMagic.autocommit=False
%sql sqlite:///../yelp_10k.sqlite

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [46]:
%%sql
SELECT
  COUNT(*) AS nb_null
FROM
  USER
WHERE
  id IS NULL
  OR NAME IS NULL
  OR review_count IS NULL
  OR yelping_since IS NULL
  OR useful IS NULL
  OR funny IS NULL
  OR cool IS NULL
  OR fans IS NULL
  OR average_stars IS NULL
  OR compliment_hot IS NULL
  OR compliment_more IS NULL
  OR compliment_profile IS NULL
  OR compliment_cute IS NULL
  OR compliment_list IS NULL
  OR compliment_note IS NULL
  OR compliment_plain IS NULL
  OR compliment_cool IS NULL
  OR compliment_funny IS NULL
  OR compliment_writer IS NULL
  OR compliment_photos IS NULL

Running query in 'sqlite:///../yelp_10k.sqlite'

+---------+
| nb_null |
+---------+
|    0    |
+---------+

We can see than none have null values

In [48]:
%%sql
SELECT
  city,
  SUM(review_count) tot_nb_reviews
FROM
  business
GROUP BY
  city
ORDER BY
  tot_nb_reviews DESC
LIMIT
  10

Running query in 'sqlite:///../yelp_10k.sqlite'

+---------------+----------------+
|      city     | tot_nb_reviews |
+---------------+----------------+
|  Philadelphia |     62134      |
|  New Orleans  |     51780      |
|   Nashville   |     32161      |
|     Tampa     |     29893      |
|     Tucson    |     26366      |
|      Reno     |     25826      |
|  Indianapolis |     23151      |
| Santa Barbara |     19463      |
|  Saint Louis  |     14309      |
|    Edmonton   |      6830      |
+---------------+----------------+
Truncated to displaylimit of 10.

In [20]:
%%sql
SELECT
  name,
  review_count
FROM
  USER
ORDER BY
  review_count DESC
LIMIT
  3

Running query in 'sqlite:///../yelp_10k.sqlite'

+--------+--------------+
|  name  | review_count |
+--------+--------------+
| Bruce  |    16567     |
|  Kim   |     9941     |
| Nijole |     8363     |
+--------+--------------+

*8. Does posting more reviews correlate with more fans?*

Hard to tell, we would need to calculate the correlation factor between the two columns. I don't know how to do this with SQL alone.

*Please explain your findings and interpretation of the results:*

In [21]:
%%sql
SELECT
  name,
  review_count,
  fans
FROM
  USER
ORDER BY
  review_count DESC
LIMIT
  15

Running query in 'sqlite:///../yelp_10k.sqlite'

+----------+--------------+------+
|   name   | review_count | fans |
+----------+--------------+------+
|  Bruce   |    16567     | 867  |
|   Kim    |     9941     | 825  |
|  Nijole  |     8363     | 921  |
|  George  |     7738     | 288  |
| Jennifer |     6679     | 828  |
|  Sunil   |     6459     | 186  |
|   Eric   |     5887     | 444  |
|    Ed    |     5800     | 2251 |
|   Rob    |     5511     | 445  |
|  Misha   |     5163     | 197  |
+----------+--------------+------+
Truncated to displaylimit of 10.

If we order my most fans

In [22]:
%%sql
SELECT
  name,
  review_count,
  fans
FROM
  USER
ORDER BY
  fans DESC
LIMIT
  15

Running query in 'sqlite:///../yelp_10k.sqlite'

+-----------+--------------+-------+
|    name   | review_count |  fans |
+-----------+--------------+-------+
|    Mike   |     1882     | 12497 |
|   Daniel  |     4333     |  3138 |
|  Jessica  |     2101     |  2627 |
|   Peter   |     3193     |  2388 |
|     Ed    |     5800     |  2251 |
|  Brittany |     2492     |  2086 |
|   Farrah  |     2073     |  2073 |
| Stephanie |     2000     |  1761 |
|    Kimi   |     1761     |  1620 |
|   Helina  |     1645     |  1570 |
+-----------+--------------+-------+
Truncated to displaylimit of 10.

summary

In [23]:
%%sql
SELECT
  name,
  review_count,
  fans,
  fans / review_count AS nb_fans_per_review
FROM
  USER
ORDER BY
  nb_fans_per_review DESC
LIMIT
  15

Running query in 'sqlite:///../yelp_10k.sqlite'

+-------------+--------------+-------+--------------------+
|     name    | review_count |  fans | nb_fans_per_review |
+-------------+--------------+-------+--------------------+
|     Mike    |     1882     | 12497 |         6          |
|   Michael   |      3       |   6   |         2          |
|     Mark    |      1       |   2   |         2          |
| Chef Frisco |      4       |   8   |         2          |
|    Amanda   |      3       |   7   |         2          |
|     Jess    |      1       |   2   |         2          |
|    chris    |      1       |   2   |         2          |
|     Jane    |     1221     |  1357 |         1          |
|   Jessica   |     2101     |  2627 |         1          |
|    Farrah   |     2073     |  2073 |         1          |
+-------------+--------------+-------+--------------------+
Truncated to displaylimit of 10.

Something I was trying to attempt is to divide users into 4 quartiles based on their review_count, and then compute the average or median number of fans for each quartile.

This is a more basic way to visualize a correlation.

I wanted to use the NTILE function but it doesn't appear to be supported by SQLite.

In [24]:
%%sql
SELECT
  name,
  review_count,
  fans,
  NTILE (4) OVER (
    ORDER BY
      review_count
  ) review_count_quartiles
FROM
  USER
ORDER BY
  review_count
LIMIT
  10

Running query in 'sqlite:///../yelp_10k.sqlite'

+---------+--------------+------+------------------------+
|   name  | review_count | fans | review_count_quartiles |
+---------+--------------+------+------------------------+
| charles |      1       |  0   |           1            |
|   Meg   |      1       |  0   |           1            |
|   Paul  |      1       |  0   |           1            |
|  Jeremy |      1       |  0   |           1            |
|  Andrew |      1       |  1   |           1            |
|  Kevin  |      1       |  0   |           1            |
| Brandon |      1       |  0   |           1            |
| William |      1       |  0   |           1            |
|   Mark  |      1       |  2   |           1            |
|  James  |      1       |  0   |           1            |
+---------+--------------+------+------------------------+
Truncated to displaylimit of 10.

-- MANUAL GROUP BY
-- I started looking for the four quartiles manually but the distribution was so stacked to the left it didn't makle much sense.
--First quartiles was a review count of 0 or 1. So I made up some thresholds instead :
-- Users in the top 100 (top 1%), the top 1000 (10%), top 5000 (top half) and bottom 5000 (bottom half)

total number of users : 10000

TOP 100 : WHERE review_count >= 344								avg nb of fans : 56.96
TOP 1000 : WHERE review_count >= 49 AND review_count < 344		avg nb of fans : 7.41
TOP 5000 : WHERE review_count >= 6 AND review_count < 49		avg nb of fans : 0.59
BOTTOM 5000 : WHERE review_count < 6							avg nb of fans : 0.06

-- I found each threshold with a simple count() query.
-- Result : There does seem to be a positive correlation if we group users in this way.

-- 9. Are there more reviews with the word "love" or with the word "hate" in them?

In [37]:
%%sql
SELECT
  SUM(
    CASE
      WHEN text LIKE '%love%' THEN 1
      ELSE 0
    END
  ) AS love_count,
  SUM(
    CASE
      WHEN text LIKE '%hate%' THEN 1
      ELSE 0
    END
  ) AS hate_count
FROM
  review

Running query in 'sqlite:///../yelp_10k.sqlite'

+------------+------------+
| love_count | hate_count |
+------------+------------+
|    1887    |    210     |
+------------+------------+

Answer: love

10. Find the top 10 users with the most fans:

In [47]:
%%sql
SELECT
  name,
  fans
FROM
  USER
ORDER BY
  fans DESC
LIMIT
  10

Running query in 'sqlite:///../yelp_10k.sqlite'

+-----------+-------+
|    name   |  fans |
+-----------+-------+
|    Mike   | 12497 |
|   Daniel  |  3138 |
|  Jessica  |  2627 |
|   Peter   |  2388 |
|     Ed    |  2251 |
|  Brittany |  2086 |
|   Farrah  |  2073 |
| Stephanie |  1761 |
|    Kimi   |  1620 |
|   Helina  |  1570 |
+-----------+-------+
Truncated to displaylimit of 10.

# Part 2: Inferences and Analysis

-- 1. Pick one city and category of your choice and group the businesses in that city or category by their overall star rating.
--Compare the businesses with 2-3 stars to the businesses with 4-5 stars and answer the following questions. Include your code.
	
-- i. Do the two groups you chose to analyze have a different distribution of hours?

-- What do they mean by distribution of hours ?

-- We have two groups, seven days, and different types of opening hours for each day and business. What is meant by distribution of hours exactly ?

-- I can create a weekly hours thing with the 168 hours
-- then do so some sort of histogram
-- Final table : mediocre vs high.
-- Rows : all 168h but could hide the ones with 0%
-- Share of mediocre restos open at that time vs share for high.

-- It's probably more advanced that what they're asking
-- ONCE we (inner) join the business and hours table, we're only left with 743 entries for the whole country.
-- There are 10k unique ids in the business table, and 1562 in the hours table, 10k overall.
-- Once we join them we're left with
-- - 743 rows
-- - 117 businesses
-- This is problematic as the sample size is getting smaller, and will likely be too small once we focus on a specific city

-- IF I filter for las vegas, one of the cities with the most businessess in the business table, I'm left with only 13 establishments.

--ENTIRE QUERY (click to expand)

In [27]:
%%sql

SELECT 
    cat_rating,
    COUNT(*) as nb_of_businesses,
    ROUND(AVG(week_total_open_hours),1) as avg_nb_weekly_opening_hours
    FROM
    (
    SELECT
        hours,
        SUM(nb_open_hours) as week_total_open_hours,
        name,
        cat_rating

    FROM
    (
        SELECT --GET TOTAL HOURS OPEN PER WEEK FOR EACH BUSINESS
            hours,
            day,
            TIME(opens_at) as time_open,
            TIME(closes_at) as time_closed,
            ROUND(
                CASE WHEN TIME(closes_at) <= TIME(opens_at) THEN
                cast((julianday(closes_at) - julianday(opens_at) + 1) * 24 as float)
                ELSE
                cast((julianday(closes_at) - julianday(opens_at)) * 24 as float)
                END,1) AS nb_open_hours,
            name,
            cat_rating,
            id,
            business_id
        FROM
        (
        SELECT
                    day,
                    opens_at_v0,
                    CASE
                        WHEN substr(opens_at_v0, -10) LIKE '%-%' THEN substr(opens_at_v0,1,5)
                        ELSE substr(opens_at_v0, 1)
                        END AS opens_at,
                    closes_at,
                    TIME(closes_at) as time_close,
                    name,
                    cat_rating,
                    hours, id, business_id
                FROM
                    (
                SELECT --group establishments into High, Mediocre and Other based on their ratings
                    id,
                    name,
                    --stars,
                    CASE
                    WHEN stars BETWEEN 2 AND 3 THEN 'Mediocre'
                    WHEN stars BETWEEN 4 AND 5 THEN 'High'
                    ELSE 'Other'
                    END AS cat_rating
                FROM business
                --WHERE city = 'Las Vegas'
                ) b
                JOIN 
                (
                SELECT --extract day and time from a day-time cell for opening hours
                    business_id,
                    hours,
                    substr(hours, 1, 3) as day,
                    CASE
                        WHEN substr(hours, -9)  LIKE '%|%' THEN '0' || substr(hours, -8,4)
                        WHEN substr(hours, -10) LIKE '%|%' THEN '0' || substr(hours, -9,4)
                        WHEN substr(hours, -11) LIKE '%|%' AND substr(hours, -5) NOT LIKE '%-%' THEN '0' || substr(hours, -10,4)
                        WHEN substr(hours, -11) LIKE '%|%' AND substr(hours, -5) LIKE '%-%' THEN substr(hours, -10,5)

                        ELSE substr(hours, -11,5)
                        END AS opens_at_v0,
                    CASE
                        WHEN substr(hours, -5) LIKE '%-%' THEN '0' || substr(hours, -4)
                        ELSE substr(hours, -5)
                        END AS closes_at
                FROM hours
                ) h

                on b.id = h.business_id

                ORDER BY day, CAST(opens_at AS TIME)
        ) 
    )

    GROUP BY id
)

GROUP BY cat_rating

Running query in 'sqlite:///../yelp_10k.sqlite'

+------------+------------------+-----------------------------+
| cat_rating | nb_of_businesses | avg_nb_weekly_opening_hours |
+------------+------------------+-----------------------------+
|    High    |       4482       |             41.4            |
|  Mediocre  |       2199       |             54.6            |
|   Other    |       1811       |             54.4            |
+------------+------------------+-----------------------------+

iii. Are you able to infer anything from the location data provided between these two groups? Explain.

In [28]:
%%sql

SELECT -- QUERY C : share of High rating businesses within the city, share of Mediocre.
    city,
    count,
    ROUND(100*nb_high/count, 1) as share_high,
    ROUND(100*nb_mediocre/count, 1) as share_mediocre

FROM
(
    SELECT -- QUERY B : number of businesses in the city, average rating, total number of reviews in that city, nb of High businesses, nb of Mediocre ones.
        city,
        COUNT(*) as count,
        ROUND(AVG(review_count),1) as avg_review_count,
        SUM(review_count) as total_reviews,
        ROUND(AVG(stars),1) as avg_rating,
        SUM(CASE WHEN cat_rating = 'High' THEN 1 ELSE 0 END) AS nb_high,
        SUM(CASE WHEN cat_rating = 'Mediocre' THEN 1 ELSE 0 END) AS nb_mediocre
    FROM
    (
        SELECT --QUERY A : assigns a category rating
            name,
            city,
            stars,
                CASE
                WHEN stars BETWEEN 2 AND 3 THEN 'Mediocre'
                WHEN stars BETWEEN 4 AND 5 THEN 'High'
                ELSE NULL
                END AS
            cat_rating,
            review_count
        FROM business
    )
    GROUP BY city
    HAVING count >= 20
)

ORDER BY count desc
LIMIT 20

Running query in 'sqlite:///../yelp_10k.sqlite'

+---------------+-------+------------+----------------+
|      city     | count | share_high | share_mediocre |
+---------------+-------+------------+----------------+
|  Philadelphia |  980  |    49.0    |      27.0      |
|     Tucson    |  628  |    51.0    |      29.0      |
|     Tampa     |  624  |    50.0    |      25.0      |
|  Indianapolis |  503  |    50.0    |      29.0      |
|   Nashville   |  467  |    53.0    |      23.0      |
|  New Orleans  |  440  |    65.0    |      16.0      |
|      Reno     |  418  |    58.0    |      21.0      |
|    Edmonton   |  345  |    43.0    |      31.0      |
|  Saint Louis  |  303  |    46.0    |      28.0      |
| Santa Barbara |  267  |    72.0    |      15.0      |
+---------------+-------+------------+----------------+
Truncated to displaylimit of 10.

-- 2. Group business based on the ones that are open and the ones that are closed. What differences can you find between the ones 
-- that are still open and the ones that are closed? List at least two differences and the SQL code you used to arrive at your answer.

-- Not exactely sure if is_open boolean means open or not right now, or permanently closed ?

-- i. Difference 1:
-- ii. Difference 2:

In [29]:
%%sql
SELECT
  is_open,
  COUNT(*) AS COUNT,
  ROUND(AVG(review_count), 1) AS avg_review_count,
  ROUND(AVG(stars), 1) AS avg_rating
FROM
  business
GROUP BY
  is_open

Running query in 'sqlite:///../yelp_10k.sqlite'

+---------+-------+------------------+------------+
| is_open | count | avg_review_count | avg_rating |
+---------+-------+------------------+------------+
|    0    |  2033 |       39.7       |    3.5     |
|    1    |  7967 |       48.8       |    3.6     |
+---------+-------+------------------+------------+

# PART III -  My own analysis

3. For this last part of your analysis, you are going to choose the type of analysis you want to conduct on the Yelp dataset and are going 
to prepare the data for analysis.

Ideas for analysis include:
- parsing out keywords and business attributes for sentiment analysis,
- clustering businesses to find commonalities or anomalies between them,
- predicting the overall star rating for a business,
- predicting the number of fans a user will have, and so on.

These are just a few examples to get you started, so feel free to be creative and come up with your own problem you want to solve.
Provide answers, in-line, to all of the following:

i. Indicate the type of analysis you chose to do:
ii. Write 1-2 brief paragraphs on the type of data you will need for your analysis and why you chose that data:
iii. Output of your finished dataset:
iv. Provide the SQL code you used to create your final dataset:

In [30]:
%%sql
SELECT
  SUM(
    CASE
      WHEN text LIKE '%tasty%' THEN 1
      ELSE 0
    END
  ) AS tasty_count,
  SUM(
    CASE
      WHEN text LIKE '%kind%' THEN 1
      ELSE 0
    END
  ) AS kind_count,
  SUM(
    CASE
      WHEN text LIKE '%welcoming%' THEN 1
      ELSE 0
    END
  ) AS welcoming_count,
  SUM(
    CASE
      WHEN text LIKE '%fast%' THEN 1
      ELSE 0
    END
  ) AS fast_count,
  SUM(
    CASE
      WHEN text LIKE '%hostile%' THEN 1
      ELSE 0
    END
  ) AS hostile_count,
  SUM(
    CASE
      WHEN text LIKE '%cold%' THEN 1
      ELSE 0
    END
  ) AS cold_count
FROM
  review;

Running query in 'sqlite:///../yelp_10k.sqlite'

+-------------+------------+-----------------+------------+---------------+------------+
| tasty_count | kind_count | welcoming_count | fast_count | hostile_count | cold_count |
+-------------+------------+-----------------+------------+---------------+------------+
|     523     |    534     |        99       |    897     |       5       |    329     |
+-------------+------------+-----------------+------------+---------------+------------+

## 3A - ADDING A COUNTRY COLUMN

--Note : I just realised the dataset wasn't restricted to the US.
--But this is made harder by the fact that there isn't a country column, just city and state.
-- That's quite unfortunate.

-- There's on in Buenos Aires, and cities in scotland, germany

In [31]:
%%sql
SELECT
  name,
  latitude,
  longitude,
  state,
  city,
  postal_code
FROM
  business
WHERE
  longitude > -65 --too east to be the US
  AND latitude < 25 --too south
GROUP BY
  state
ORDER BY
  state

Running query in 'sqlite:///../yelp_10k.sqlite'

+------+----------+-----------+-------+------+-------------+
| name | latitude | longitude | state | city | postal_code |
+------+----------+-----------+-------+------+-------------+
+------+----------+-----------+-------+------+-------------+

-- In the whole business, there are 10k entries, but only 23 distinct states

-- Let's investigate :

In [32]:
%%sql
SELECT
  state,
  AVG(latitude),
  AVG(longitude),
  COUNT(id) AS nb_of_businesses
FROM
  business
GROUP BY
  state
ORDER BY
  state

Running query in 'sqlite:///../yelp_10k.sqlite'

+-------+--------------------+---------------------+------------------+
| state |   avg(latitude)    |    avg(longitude)   | nb_of_businesses |
+-------+--------------------+---------------------+------------------+
|   AB  | 53.533211103862236 | -113.50501101601792 |       395        |
|   AZ  | 32.24746215165541  | -110.93462610641994 |       666        |
|   CA  | 34.43826687672294  | -119.72145021038222 |       358        |
|   CO  |     32.0948541     |     -110.7734914    |        1         |
|   DE  | 39.73737778651812  |  -75.59406686966038 |       149        |
|   FL  | 27.984385486345367 |  -82.56649302181282 |       1727       |
|   ID  | 43.61950376009498  | -116.27551029220386 |       259        |
|   IL  | 38.64109143099345  |  -90.0201083648993  |       152        |
|   IN  | 39.81941494063166  |  -86.1579908658634  |       741        |
|   LA  | 29.961006101460335 |  -90.10465055870428 |       678        |
+-------+--------------------+---------------------+------------------+
Truncated to displaylimit of 10.

For the US, business in only eight states are present :
- AZ	Arizona
- IL	Illinois
- NC	North Carolina
- NV	Nevada
- NY	New York (Only two businesses, with a third one actually being located in vegas)
- OH	Ohio
- PA	Pennsylvania
- SC	South Carolina
- WI	Wisconsin

-- We can see that the dataset isn't perfect, for example :

In [33]:
%%sql
SELECT
  *
FROM
  business
WHERE
  state = 'NY'

Running query in 'sqlite:///../yelp_10k.sqlite'

+----+------+---------+------+-------+-------------+----------+-----------+-------+--------------+---------+
| id | name | address | city | state | postal_code | latitude | longitude | stars | review_count | is_open |
+----+------+---------+------+-------+-------------+----------+-----------+-------+--------------+---------+
+----+------+---------+------+-------+-------------+----------+-----------+-------+--------------+---------+

In [34]:
%%sql
SELECT
  text
FROM
  review
LIMIT
  10

Running query in 'sqlite:///../yelp_10k.sqlite'

+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                                                                                                                                                                                                                                                                                                                                 text                                                                                                                                                                                                                                                                                                                                                                                                                 |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                                                                                                                                                                                                               If you decide to eat here, just be aware it is going to take about 2 hours from beginning to end. We have tried it multiple times, because I want to like it! I have been to it's other locations in NJ and never had a bad experience.                                                                                                                                                                                                                                                                                                |
|                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
|                                                                                                                                                                                                                                                                       The food is good, but it takes a very long time to come out. The waitstaff is very young, but usually pleasant. We have just had too many experiences where we spent way too long waiting. We usually opt for another diner or restaurant on the weekends, in order to be done quicker.                                                                                                                                                                                                                                                                        |
|                                                                                                                                                                                                                                                                                                 I've taken a lot of spin classes over the years, and nothing compares to the classes at Body Cycle. From the nice, clean space and amazing bikes, to the welcoming and motivating instructors, every class is a top notch work out.                                                                                                                                                                                                                                                                                                  |
|                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
|                                                                                                                                                                                                                                                                                                                          For anyone who struggles to fit workouts in, the online scheduling system makes it easy to plan ahead (and there's no need to line up way in advanced like many gyms make you do).                                                                                                                                                                                                                                                                                                                          |
|                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
|                                                                                                                                                                                                 There is no way I can write this review without giving Russell, the owner of Body Cycle, a shout out. Russell's passion for fitness and cycling is so evident, as is his desire for all of his clients to succeed. He is always dropping in to classes to check in/provide encouragement, and is open to ideas and recommendations from anyone. Russell always wears a smile on his face, even when he's kicking your butt in class!                                                                                                                                                                                                 |
|                                                                                                                                                                                                                                         Family diner. Had the buffet. Eclectic assortment: a large chicken leg, fried jalapeño, tamale, two rolled grape leaves, fresh melon. All good. Lots of Mexican choices there. Also has a menu with breakfast served all day long. Friendly, attentive staff. Good place for a casual relaxed meal with no expectations. Next to the Clarion Hotel.                                                                                                                                                                                                                                          |
|                                                                                                                                                                                                                                                                                         Wow!  Yummy, different,  delicious.   Our favorite is the lamb curry and korma.  With 10 different kinds of naan!!!  Don't let the outside deter you (because we almost changed our minds)...go in and try something new!   You'll be glad you did!                                                                                                                                                                                                                                                                                          |
|                                                                                                                                        Cute interior and owner (?) gave us tour of upcoming patio/rooftop area which will be great on beautiful days like today. Cheese curds were very good and very filling. Really like that sandwiches come w salad, esp after eating too many curds! Had the onion, gruyere, tomato sandwich. Wasn't too much cheese which I liked. Needed something else...pepper jelly maybe. Would like to see more menu options added such as salads w fun cheeses. Lots of beer and wine as well as limited cocktails. Next time I will try one of the draft wines.                                                                                                                                        |
|                                                                                                                                                                                                                                        I am a long term frequent customer of this establishment. I just went in to order take out (3 apps) and was told they're too busy to do it. Really? The place is maybe half full at best. Does your dick reach your ass? Yes? Go fuck yourself! I'm a frequent customer AND great tipper. Glad that Kanella just opened. NEVER going back to dmitris!                                                                                                                                                                                                                                         |
| Loved this tour! I grabbed a groupon and the price was great. It was the perfect way to explore New Orleans for someone who'd never been there before and didn't know a lot about the history of the city. Our tour guide had tons of interesting tidbits about the city, and I really enjoyed the experience. Highly recommended tour. I actually thought we were just going to tour through the cemetery, but she took us around the French Quarter for the first hour, and the cemetery for the second half of the tour. You'll meet up in front of a grocery store (seems strange at first, but it's not terribly hard to find, and it'll give you a chance to get some water), and you'll stop at a visitor center part way through the tour for a bathroom break if needed. This tour was one of my favorite parts of my trip! |
|                                                                                                                                                                                                                                                                                                                   Amazingly amazing wings and homemade bleu cheese. Had the ribeye: tender, perfectly prepared, delicious. Nice selection of craft beers. Would DEFINITELY recommend checking out this hidden gem.                                                                                                                                                                                                                                                                                                                   |
|                                                                                                                                            This easter instead of going to Lopez Lake we went to Los Padres National Forest which is really pretty but if you go to white rock the staff needs to cut down all the dead grass that invades the rock and the water. I would wish the staff would also clean or get rid of the dead grass that's also living by the water. The water is really green and dirty. Los padres national forest staff need to work hard to maintain this forest looking pretty and not like a dumpster. Even Cachuma lake looks like they put a bit more effort.                                                                                                                                            |
|                                                                                                                                             Had a party of 6 here for hibachi. Our waitress brought our separate sushi orders on one plate so we couldn't really tell who's was who's and forgot several items on an order. I understand making mistakes but the restaraunt was really quiet so we were kind of surprised. Usually hibachi is a fun lively experience and our  cook  said maybe three words, but he cooked very well his name was Francisco. Service was fishy, food was pretty good, and im hoping it was just an off night here. But for the money I wouldn't go back.                                                                                                                                             |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.